/*******************************************************************************
*  skL6470.c - L6470ステッピングモータドライバ関数ライブラリ                   *
*                                                                              *
*    L6470_Init  - L6470の初期化を行う処理                                     *
*    L6470_GetRegister - レジスタのデータを読み込む処理                        *
*    L6470_ALARM - アラームの情報を読み込む処理                                *
*    L6470_Run   - モータを一定速度で回転させる処理                            *
*    L6470_Move  - モータを指定ステップ数まで回転させる処理                    *
*    L6470_Stop  - モータを停止させる処理                                      *
*                                                                              *
* ============================================================================ *
*  VERSION DATE        BY                    CHANGE/COMMENT                    *
* ---------------------------------------------------------------------------- *
*  1.00    2016-07-07  きむ茶工房(きむしげ)  Create                            *
* ============================================================================ *
*  PIC 18F2xK22 (このライブラリ自体は他のＰＩＣでもＯＫと思います)             *
*  MPLAB X(v2.15)                                                              *
*  MPLAB(R) XC8 C Compiler Version 1.32                                        *
*******************************************************************************/
#include <xc.h>
#include "SPIlib.h"
#include "L6470.h"

int Busy ;

// L6470にコマンドを送信する処理
void CMD_Send(char cmd,unsigned long val,int num)
{
     unsigned char dt[4] ;
     int i ;

     for (i=0 ; i<num ; i++) {
          dt[i] = val & 0xff ;
          val = val >> 8 ;
     }

     L6470_CS = 0 ;
     SPI_transfer(cmd) ;                // コマンドの送信
     L6470_CS = 1 ;
     switch (num) {
        case 3:
               L6470_CS = 0 ;
               SPI_transfer(dt[2]) ;    // パラメータ２の送信
               L6470_CS = 1 ;
        case 2:
               L6470_CS = 0 ;
               SPI_transfer(dt[1]) ;    // パラメータ１の送信
               L6470_CS = 1 ;
        case 1:
               L6470_CS = 0 ;
               SPI_transfer(dt[0]) ;    // パラメータ０の送信
               L6470_CS = 1 ;
               break ;
     }
}
/*******************************************************************************
*  ans = L6470_Init()                                                          *
*    L6470の初期化を行う処理                                                   *
*                                                                              *
*    ans : 現在のSTATUS情報を返す                                               *
*******************************************************************************/
unsigned long L6470_Init()
{
     union STEP_MODE_t step_mode ;
     union CONFIG_t config ;
     long  val ;
     int i ;

     // L6470にリセットを掛ける
     for (i=0 ; i<4 ; i++) {
          L6470_CS = 0 ;
          SPI_transfer(0x00) ;     // NOPの送信
          L6470_CS = 1 ;
     }
     L6470_CS = 0 ;
     SPI_transfer(0xC0) ;          // ResetDeviceコマンドの送信
     L6470_CS = 1 ;
     // 各種レジスタに設定を行う(SetParam)
     CMD_Send(L6470_ACC,0x008A,2) ;          //   加速時の係数(2022.45 Step/s^2)
     CMD_Send(L6470_DEC,0x008A,2) ;          //   減速時の係数(2022.45 Step/s^2)
     CMD_Send(L6470_MAX_SPEED,0x0020,2) ;    // 最大回転速度(503.25 Step/s^2)
     CMD_Send(L6470_MIN_SPEED,0x0001,2) ;    //   最少回転速度(0 Step/s^2 低速の最適化機能無効)
     CMD_Send(L6470_KVAL_HOLD,0xFF,1) ;      // 停止時の電圧(最大 0.996xVs)
     CMD_Send(L6470_KVAL_RUN,0xF0,1) ;       //   定速時の電圧(最大 0.996xVs)
     CMD_Send(L6470_KVAL_ACC,0xF0,1) ;       //   加速時の電圧(最大 0.996xVs)
     CMD_Send(L6470_KVAL_DEC,0xF0,1) ;       //   減速時の電圧(最大 0.996xVs)
     CMD_Send(L6470_OCD_TH,0x0F,1) ;         // 過電流の閾値(3A)
     CMD_Send(L6470_STALL_TH,0x7F,1) ;       // ストール電流の閾値(2A)
      // ステップモードの設定
     step_mode.DT = 0x07 ;                   // デフォルト値
     step_mode.STEP_SEL = FULL_STEP ;        // フルステップに設定
     step_mode.SYNC_EN  = Busy = 0 ;         // BUSY出力モード
     val = step_mode.DT ;
     CMD_Send(L6470_STEP_MODE,val,1) ;
     // コンフィグの設定
     config.DT = 0x2F88 ;                    // デフォルト値(PWM周波数:15.6KHz)
     config.OSC_SEL = OSC_INT16MHZ ;         // クロックは内蔵16MHz
     config.EXT_CLK = 0 ;                    // クロック出力(OSCOUT)はなし
     config.SW_MODE = 1 ;                    // ハード停止モード
     val = config.DT ;
     CMD_Send(L6470_CONFIG,val,2) ;          // コンフィグの設定
     return L6470_GetRegister(L6470_STATUS,2) ;// 現在のステータスを返す。
}
/*******************************************************************************
*  ans = L6470_GetRegister(regadrs,num)                                        *
*    レジスタのデータを読み込む処理                                            *
*                                                                              *
*    regadrs : 読み取りたいレジスタのアドレスを指定(0x01-0x1B)                 *
*    num     : レジスタの読み取るデータのバイト数(1-3byte)                     *
*    ans     : 読み取ったデータをlong値で返す                                  *
*******************************************************************************/
unsigned long L6470_GetRegister(char regadrs,int num)
{
     unsigned long ans , dt ;
     int i ;

     L6470_CS = 0 ;
     if (regadrs == L6470_STATUS) SPI_transfer(0xD0) ; // GetStatusコマンドの送信
     else SPI_transfer(regadrs|0x20) ;                 // GetParamコマンドの送信
     L6470_CS = 1 ;
     ans = dt = 0 ;
     for (i=0 ; i<num ; i++) {
          ans = ans << 8 ;
          L6470_CS = 0 ;
          dt = SPI_transfer(0x00) ;     // レスポンデータを得る為にダミーの送信
          L6470_CS = 1 ;
          ans = ans | dt ;
     }
     return ans ;
}
/*******************************************************************************
*  ans = L6470_ALARM()                                                         *
*    アラームの情報を読み込む処理                                              *
*    FLAGピンがLOWにてアラーム発生です、割り込みで受けましょう。               *
*    この関数は、”GetStatus”コマンドを発行しているのでアラームは解除されます *
*                                                                              *
*    ans：発生したアラーム情報を返す                                           *
*         0=アラームは発生していない                                           *
*         3=スイッチイベントを検出                                             *
*         7=コマンドが実行できない                                             *
*         8=コマンドが全く存在しない                                           *
*         9=定電圧を検出                                                       *
*        10=熱警告を検出                                                       *
*        11=サーマルシャットダウンを検出                                       *
*        12=過電流を検出                                                       *
*        13=Ａ相ストールを検出                                                 *
*        14=Ｂ相ストールを検出                                                 *
*******************************************************************************/
int L6470_ALARM()
{
     unsigned long dt ;
     int i ;

     dt = L6470_GetRegister(L6470_STATUS,2) ;
     for (i=14;i>=9;i--) {
          if ((dt && (1<<i)) == 0) return i ;
     }
     for (i=8;i>=7;i--) {
          if ((dt && (1<<i)) != 0) return i ;
     }
     if ((dt && (1<<3)) != 0) return 3 ;
     return 0 ;
}
/*******************************************************************************
*  L6470_Run(dir,speed)                                                        *
*    モータを一定速度で回転させる処理                                          *
*    選択されているステッピングモードにより回転します                          *
*                                                                              *
*    dir   : 回転させる方向を指示します(0=逆転  1=正転)                        *
*    speed : 回転させる目標速度を指示します                                    *
*            0.015step/sの分解能で0(0.015)-104166(15625)のステップです。       *
*            MAX_SPEEDより低く、MIN_SPEEDより大きくなければなりません。        *
*******************************************************************************/
void L6470_Run(char dir,unsigned long speed)
{
     while( (Busy==0) && (L6470_BUSY==0) ) ; // コマンド実行中なら待つ
     CMD_Send(0x50|dir,speed,3) ;            // 一定速度回転コマンドの送信
}
/*******************************************************************************
*  L6470_Move(dir,step)                                                        *
*    モータを指定ステップ数まで回転させる処理                                  *
*    選択されているステッピングモードによりステップ当りの回転角度は変わります。*
*    例えば、step=200でフルステップモードなら１回転(360度)です。               *
*                                                                              *
*    dir   : 回転させる方向を指示します(0=逆転  1=正転)                        *
*    speed : 回転させる目標ステップ数を指示します(0-4194303:22bit)             *
*******************************************************************************/
void L6470_Move(char dir,unsigned long step)
{
    PORTCbits.RC2 = 1;
     while( (Busy==0) && (L6470_BUSY==0) ) ; // コマンド実行中なら待つ
     CMD_Send(0x40|dir,step,3) ;             // 移動コマンドの送信
}
/*******************************************************************************
*  L6470_Stop(mode)                                                            *
*    モータを停止させる処理                                                    *
*    Hizはモータを停止させた後、モータの出力をOFF(ハイインピーダンス)にします。*
*                                                                              *
*    mode : 停止モードを指定します                                             *
*           0 = SoftStop 減速しながらモータを停止させます、保持トルク有り。    *
*           1 = HardStop 即時にモータを停止させます、保持トルク有り。          *
*           2 = SoftHiz  減速しながらモータを停止させます、保持トルク無し。    *
*           3 = HardHiz  即時にモータを停止させます、保持トルク無し。          *
*******************************************************************************/
void L6470_Stop(int mode)
{
     unsigned char cmd[4] = {0xB0,0xB8,0xA0,0xA8} ;

     while( (Busy==0) && (L6470_BUSY==0) ) ; // コマンド実行中なら待つ
     L6470_CS = 0 ;
     SPI_transfer(cmd[mode]) ;               // ストップコマンドの送信
     L6470_CS = 1 ;
}

void L6470_CMD(int command){
    while( (Busy==0) && (L6470_BUSY==0) ) ; // コマンド実行中なら待つ
     L6470_CS = 0 ;
     SPI_transfer(command) ;               // ストップコマンドの送信
     L6470_CS = 1 ;
}
